app/controllers/charges_controller.rb

  def create

    # set api key for Stripe calls
    Stripe.api_key = ENV['STRIPE_SECRET_KEY']

    pl = PreLeague.find(current_user.pre_league_id)
    # Get the credit card details submitted by the form
    token = params[:stripeToken]
    league = pl["league_name"]
    @amount  = (pl[:max_teams] * pl[:max_players_per_team])
    @amount_in_cents = @amount * 100
    # Create the charge on Stripe's servers - this will charge the user's card
    begin

      # check for card errors
    rescue Stripe::CardError => e
      flash[:error] = e.message
      redirect_to new_charge_path
    end
    # Do everything after the payment has been set up
    # create league specific plan
    begin
      Stripe::Plan.create(
        :amount => @amount_in_cents,
        :interval => "year",
        :name => pl["league_name"]+ " League Plan" ,
        :currency => "usd",
        :id => pl["league_name"],
        :trial_period_days => 30
      )
---
SELECT  "public"."pre_leagues".* FROM "public"."pre_leagues" WHERE "public"."pre_leagues"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "leagues" ("name", "subdomain", "url", "max_teams", "max_players_per_team", "admin_name", "admin_email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def confirmation
    # find PreLeague from current_user
    @pl = PreLeague.find(current_user.pre_league_id)
    # find league by preleague subdomain
    @league = League.find_by_subdomain(@pl.subdomain)
---
SELECT  "public"."pre_leagues".* FROM "public"."pre_leagues" WHERE "public"."pre_leagues"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."subdomain" = $1 LIMIT 1  [["subdomain", "mctesterpants"]]