app/controllers/games_controller.rb

  def new
    set_time_options
    @game = Game.new
    @teams = Team.all
---
SELECT "teams".* FROM "teams"