app/controllers/home_controller.rb

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."subdomain" = $1 LIMIT 1  [["subdomain", "mctesterpants"]]
---
  def index
    # on root directory, signout current_user since there is no sign in here.
    if current_user && (current_user.subdomain != request.subdomain)
      sign_out current_user
    end
    # set @league if on subdomain
    if !request.subdomain.blank?
      @league = League.find_by_subdomain(request.subdomain)