app/controllers/leagues_controller.rb

  def create
    @league = League.create(league_params)
---
INSERT INTO "leagues" ("name", "url", "max_teams", "max_players_per_team", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"