app/controllers/players_controller.rb

  def update
    @player = Player.find(params[:id])
    respond_to do |format|
      if @player.update_attributes(player_params)
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "players" SET "email" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["email", "eatyourheartout@gmail.com"], ["updated_at", "2016-01-08 14:27:15.365618"], ["id", 1]]