app/controllers/pre_leagues_controller.rb

  def create
    if !params["bot-buster"].blank?
      redirect_to :back, :flash => {:error => "BUSTED you, robot!"}
    else
      @pre_league = PreLeague.new(pre_league_params)
      if @pre_league.save
---
INSERT INTO "public"."pre_leagues" ("admin_name", "subdomain", "league_name", "max_teams", "max_players_per_team", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"