app/controllers/subscriptions_controller.rb

  def create
    ap "Inside Create Payment"
    ap params

    # Get the credit card details submitted by the form
    token = params[:stripeToken]
    plan  = params[:plan][:stripe_id]
    email = current_user.email
    # Create a Customer
    customer = Stripe::Customer.create(
      :source => token,
      :plan => plan,
      :email => email
    )

    # Customer created with valid subscription
    # so, update account model

    account = Account.find_by_email(current_user.email)
    account.stripe_plan_id = plan
    account.save!
---
UPDATE "public"."accounts" SET "stripe_plan_id" = $1, "customer_id" = $2, "active_until" = $3, "updated_at" = $4 WHERE "public"."accounts"."id" = $5  [["stripe_plan_id", "test_plan"], ["customer_id", "cus_7XXjdHmopZOCEj"], ["active_until", "2016-12-15 23:55:38.000000"], ["updated_at", "2015-12-15 23:55:39.081236"], ["id", 1]]