app/controllers/subscriptions_controller.rb

SELECT  "public"."accounts".* FROM "public"."accounts" WHERE "public"."accounts"."email" = $1 LIMIT 1  [["email", "robertschwar@gmail.com"]]
---
  def index
    @account = Account.find_by_email(current_user.email)

SELECT "public"."plans".* FROM "public"."plans"
---
  def new
    @plans = Plan.all

SELECT  "public"."accounts".* FROM "public"."accounts" WHERE "public"."accounts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "public"."plans".* FROM "public"."plans"
---
  def edit
    @account = Account.find(params[:id])
    @plans   = Plan.all

SELECT  "public"."accounts".* FROM "public"."accounts" WHERE "public"."accounts"."email" = $1 LIMIT 1  [["email", "robertschwar@gmail.com"]]
---
  def create
    # Get the credit card details submitted by the form
    token           = params[:stripeToken]
    plan            = params[:plan][:stripe_id]
    email           = current_user.email
    current_account = Account.find_by_email(current_user.email)