app/controllers/teams_controller.rb

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "teams".* FROM "teams"
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Team Name 1"], ["created_at", "2016-01-06 21:17:50.998250"], ["updated_at", "2016-01-06 21:17:50.998250"]]
---
  def index
    @league = League.find_by_subdomain(request.subdomain)

    # there should always only be 1 league per subdomain
    @league = League.find(1)
    @teams = Team.all
    # create max amount of teams when they first come to the team index page
    if @teams.blank?
        @count = 1
        @league.max_teams.times {
          @team_name  = "Team Name #{@count}"
          Team.create(
          name: @team_name
          )

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "players".* FROM "players" WHERE "players"."team_id" = $1  [["team_id", 1]]
INSERT INTO "players" ("name", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Player Name 1"], ["team_id", 1], ["created_at", "2016-01-08 14:26:42.661053"], ["updated_at", "2016-01-08 14:26:42.661053"]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @league = League.find_by_subdomain(request.subdomain)

    id = params[:id]
    @league = League.find(1)
# check if any players are on the team
    @players  = Player.where(:team_id => id)
    if @players.blank?
        @count = 1
        # create max amount of players when they first come to the team edit page
        @league.max_players_per_team.times {
          @player_name  = "Player Name #{@count}"
          Player.create(
          name: @player_name,
          team_id: id
          )
          @count += 1
        }
    end
    @players = Player.where(:team_id => id)
    @team = Team.find(id)

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "players".* FROM "players" WHERE "players"."team_id" = $1  [["team_id", 1]]
INSERT INTO "players" ("name", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Player Name 1"], ["team_id", 1], ["created_at", "2016-01-06 21:19:50.539996"], ["updated_at", "2016-01-06 21:19:50.539996"]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @league = League.find_by_subdomain(request.subdomain)

    id = params[:id]
    @league = League.find(1)
# check if any players are on the team
    @players  = Player.where(:team_id => id)
    if @players.blank?
        @count = 1
        # create max amount of players when they first come to the team edit page
        @league.max_players_per_team.times {
          @player_name  = "Player Name #{@count}"
          Player.create(
          name: @player_name,
          team_id: id
          )
          @count += 1
        }
    end
    @players = Player.where(:team_id => id)
    @team = Team.find(id)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "teams" SET "name" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["name", "Robs rickety team"], ["updated_at", "2016-01-08 14:26:56.135677"], ["id", 1]]
---
  def update
    @team = Team.find(params[:id])
    respond_to do |format|
      if @team.update_attributes(team_params)